#Область СлужебныеПроцедурыИФункции
Процедура ДополнитьФорму (Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеВКонтактноеЛицоГруппаШапкаПраво(Форма);
		ВставитьПолеСкидкаНаФормуПодОрганизация(Форма);
	КонецЕсли
	
КонецПроцедуры

Процедура УстановитьСвязьПараметровВыбора(ПолеВвода)
	
	ПолеВвода.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый массив);
	НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НоваяСвязь);
	ПолеВвода.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
	
КонецПроцедуры

Процедура ДобавитьПолеВКонтактноеЛицоГруппаШапкаПраво(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.НЕТО_КонтактноеЛицо";   
	
	УстановитьСвязьПараметровВыбора(ПолеВвода);

КонецПроцедуры

Процедура ВставитьПолеСкидкаНаФормуПодОрганизация(Форма)
	
	ГГруппа = Форма.Элементы.Добавить("ГруппаСкидка", Тип("ГруппаФормы"),Форма.Элементы.ГруппаШапкаЛево); 
	ГГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
    ГГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
	ПолеВвода = Форма.Элементы.Добавить("Скидка", Тип("ПолеФормы"),ГГруппа);
	ПолеВвода.Заголовок = "Скидка";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.НЕТО_Скидка";
	ПолеВвода.УстановитьДействие("ПриИзменении", "НЕТО_СкидкаПриИзмененииПосле");
	
	
	НоваяКоманда = Форма.Команды.Добавить("ПересчитатьСУчетомСкидки");
	НоваяКоманда.Заголовок = "Пересчитать";
	НоваяКоманда.Действие = "ПересчитатьСУчетомСкидки";   
		
	Кнопка = Форма.Элементы.Добавить("КнопкаПересчитать", Тип("КнопкаФормы"), ГГруппа);
	Кнопка.ИмяКоманды = "ПересчитатьСУчетомСкидки"; 
	
КонецПроцедуры
#КонецОбласти