#Область СлужебныеПроцедурыИФункции
Процедура ДополнитьФорму (Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеВКонтактноеЛицоГруппаШапкаПраво(Форма);
	КонецЕсли
	
КонецПроцедуры

Процедура УстановитьСвязьПараметровВыбора(ПолеВвода)
	
	ПолеВвода.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый массив);
	НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НоваяСвязь);
	ПолеВвода.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
	
КонецПроцедуры

Процедура ДобавитьПолеВКонтактноеЛицоГруппаШапкаПраво(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.НЕТО_КонтактноеЛицо";   
	
	УстановитьСвязьПараметровВыбора(ПолеВвода);

КонецПроцедуры
#КонецОбласти